docs: add graph for web4
