--- a/web/4/readme.md
+++ b/web/4/readme.md
@@ -393,29 +393,147 @@ def consume_point_function(args):
 ```
 
 那么逻辑大致是：
-```plantuml
-@startuml
-|正常|
-start
-partition 发货 {
-  :添加钻石个数;
+```graphviz
+digraph G {
+    node [shape=record]
+
+	subgraph cluster_0 {
+		style=filled;
+		color=grey90;
+		node [style=filled,color=white];
+		label = "发货";
+        添加钻石个数;
+	}
+
+	subgraph cluster_1 {
+	    style=filled;
+	    color=grey90;
+		node [style=filled, color=white];
+		label = "支付";
+		检查剩余点数;
+		扣除点数;
+	}
+
+	subgraph cluster_2 {
+	    style=filled;
+	    color=grey90;
+		node [style=filled, color=white];
+		label = "回滚";
+		回滚钻石个数;
+	}
+	
+	开始 -> 添加钻石个数;
+	添加钻石个数 -> 检查剩余点数;
+	检查剩余点数 -> 扣除点数 [label = 足够];
+	扣除点数 -> 交易成功;
+	检查剩余点数 -> 回滚钻石个数 [label = 不足];
+	回滚钻石个数 -> 交易失败;
 }
-partition 扣款 {
-  if (检查剩余点数) then (足够)
-    |正常|
-    :扣除点数;
-  else (不足)
-    |异常|
-    :回滚数据;
-    stop
-  endif
-}
-|正常|
-stop
-@enduml
 ```
 
+```graphviz
+digraph g {
